cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "thoughtbot/formulae"
tap "mloberg/formuoli"

brew "ack"
brew "antibody"
brew "awscli"
brew "bash"
brew "coreutils"
brew "dnscrypt-proxy"
brew "dnsmasq-dnssec"
brew "dtrx"
brew "fzf"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "git-standup"
brew "go"
brew "gron"
brew "htop"
brew "httpie"
brew "jq"
brew "lesspipe"
brew "m-cli"
brew "mkcert"
brew "mycli"
brew "n"
brew "nss"
brew "packer"
brew "pinentry-mac"
brew "pipenv"
brew "privoxy"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "readline"
brew "rbenv"
brew "rbenv-default-gems"
brew "rcm"
brew "shellcheck"
brew "spoof-mac"
brew "thefuck"
brew "the_silver_searcher"
brew "tldr"
brew "wget"
brew "zsh"

cask "1password"
cask "aerial"
cask "brave-browser"
cask "caffeine"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-monoid"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "google-chrome"
cask "gpg-suite"
cask "hyper"
cask "jetbrains-toolbox"
cask "kitematic"
cask "lunchy"
cask "macdown"
cask "sequel-pro"
cask "tower2"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"

# Security apps
cask "knockknock"
cask "blockblock"
cask "dhs"
cask "oversight"
cask "do-not-disturb"
cask "protonvpn"
cask "little-snitch"

case `hostname`.strip
when 'Apollo' # Personal laptop
  cask "ableton-live-suite9"
  cask "ilok-license-manager"
  cask "guitar-pro"
  # mas "Affinity Photo", id: 824183456
when 'Artemis', 'Adrestia' # Work laptop
  cask "slack"
end
