cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "thoughtbot/formulae"

brew "ack"
brew "antibody"
brew "aspell"
brew "coreutils"
brew "dtrx"
brew "fzf"
brew "git"
brew "git-lfs"
brew "go"
brew "golangci-lint"
brew "gron"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lesspipe"
brew "m-cli"
brew "mkcert"
brew "n"
brew "nss"
brew "packer"
brew "pinentry-mac"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "readline"
brew "rbenv"
brew "rbenv-default-gems"
brew "rcm"
brew "shellcheck"
brew "skaffold"
# brew "spoof-mac"
brew "starship"
brew "terraform"
brew "tflint"
# brew "thefuck"
brew "the_silver_searcher"
brew "tldr"
brew "vim"
brew "wget"
brew "zsh"

brew "dnsmasq"
brew "dnscrypt-proxy"
brew "privoxy"

cask "1password"
cask "aerial"
cask "brave-browser"
cask "caffeine"
cask "dash"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-monoid"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "google-chrome"
cask "gpg-suite"
cask "hyper"
cask "imagealpha"
cask "imageoptim"
cask "insomnia"
# cask "lunchy"
cask "sequel-pro"
cask "tableplus"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"

# Security apps
cask "knockknock"
cask "blockblock"
cask "dhs"
cask "oversight"
cask "do-not-disturb"
cask "little-snitch"

mas "Affinity Photo", id: 824183456
mas "Irvue", id: 1039633667

case `hostname`.strip
when 'Apollo' # Personal laptop
  cask "ableton-live-suite9"
  cask "ilok-license-manager"
  cask "guitar-pro"
  cask "protonvpn"
when 'Adestria' # Work laptop
  cask "slack"
  mas "Jira", id: 1475897096
end
