cask_args appdir: "/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "thoughtbot/formulae"
tap "getantibody/tap"

tags = (ENV["HOMEBREW_TAGS"] || "").split(" ")

brew "ack"
brew "antibody"
brew "aspell"
brew "coreutils"
brew "dtrx"
brew "fzf"
brew "git"
brew "git-lfs"
brew "git-standup"
brew "go"
brew "gron"
brew "httpie"
brew "imagemagick" if tags.include? "design"
brew "jq"
brew "lesspipe"
brew "m-cli"
brew "mkcert"
brew "n"
brew "nss"
brew "packer"
brew "pinentry-mac"
brew "pyenv"
brew "reattach-to-user-namespace"
brew "readline"
brew "rbenv"
brew "rbenv-default-gems"
brew "rcm"
brew "shellcheck"
brew "skaffold"
# brew "spoof-mac"
brew "starship"
brew "terraform"
brew "tflint"
# brew "thefuck"
brew "the_silver_searcher"
brew "tldr"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "aerial"
cask "brave-browser"
cask "caffeine"
cask "dash"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-lato"
cask "font-monoid"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "gpg-suite"
cask "hyper"
cask "imagealpha" if tags.include? "design"
cask "imageoptim" if tags.include? "design"
cask "insomnia"
# cask "lunchy"
cask "sequel-pro"
cask "tableplus"
cask "vagrant" if tags.include? "vagrant"
cask "virtualbox" if tags.include? "vagrant"
cask "visual-studio-code"

# Quicklook plugins
cask "qlmarkdown"
cask "quicklook-json"

# Security apps
cask "knockknock"
cask "blockblock" if tags.include? "harden"
cask "dhs" if tags.include? "harden"
cask "oversight"
cask "do-not-disturb"
cask "little-snitch" if tags.include? "harden"
cask "protonvpn" if tags.include? "harden"

mas "Affinity Photo", id: 824183456  if tags.include? "design"
mas "Irvue", id: 1039633667
# mas "Jira", id: 1475897096

cask "ilok-license-manager" if tags.include? "music"
cask "guitar-pro" if tags.include? "music"
