DavidAnson.vscode-markdownlint
EditorConfig.EditorConfig
Gruntfuggly.todo-tree
KnisterPeter.vscode-commitizen
MehediDracula.php-namespace-resolver
TheNouillet.symfony-vscode
abierbaum.vscode-file-peek
alexkrechik.cucumberautocomplete
azdanov.vscode-easy-coding-standard
bbenoist.vagrant
bierner.emojisense
bierner.markdown-emoji
bmewburn.vscode-intelephense-client
calebporzio.better-phpunit
christian-kohler.path-intellisense
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
eamodio.gitlens
ecodes.vscode-phpmd
eriklynd.json-tools
felixfbecker.php-debug
formulahendry.auto-rename-tag
formulahendry.code-runner
golang.go
johnpapa.vscode-peacock
jspolancor.presentationmode
mechatroner.rainbow-csv
minamarkham.yonce-theme
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.vscode-typescript-tslint-plugin
ms-vsliveshare.vsliveshare
neilbrayfield.php-docblocker
octref.vetur
phproberto.vscode-php-getters-setters
pnp.polacode
redhat.vscode-yaml
travisthetechie.write-good-linter
vincaslt.highlight-matching-tag
vscode-icons-team.vscode-icons
whatwedo.twig
