alexkrechik.cucumberautocomplete
bbenoist.vagrant
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eamodio.gitlens
eriklynd.json-tools
felixfbecker.php-debug
felixfbecker.php-intellisense
felixfbecker.php-pack
formulahendry.code-runner
jspolancor.presentationmode
MehediDracula.php-namespace-resolver
minamarkham.yonce-theme
ms-python.python
ms-vscode.Go
ms-vscode.vscode-typescript-tslint-plugin
neilbrayfield.php-docblocker
octref.vetur
PeterJausovec.vscode-docker
phproberto.vscode-php-getters-setters
whatwedo.twig
